/*

Άσκηση 2η
Ο αλγόριθμος ταξινόμησης με επιλογή (insertion sort) για ένα πίνακα (έστω Α) 
n στοιχείων βασίζεται σε σάρωμα του πίνακα και εφαρμογή επαναληπτικά των ακόλουθων
τριών βημάτων: 

*   (i) επιλογή του στοιχείου με την ελάχιστη τιμή, 
*  (ii) ανταλλαγή του στοιχείου με το πρώτο στοιχείο Α[0], 
* (iii) επανάληψη των (i), (ii) με τα υπόλοιπα στοιχεία (Α[1]...Α[n-1]).

Μετά από n-1 επαναλήψεις τα στοιχεία του πίνακα θα είναι διατεταγμένα κατά
αύξουσα σειρά. Υλοποιήστε τον αλγόριθμο για ένα πίνακα από Ν στοιχεία, όπου
τόσο τα στοιχεία του πίνακα, όσο και ο αριθμός τους θα πρέπει να δίνεται από
τον χρήστη (συνεπώς ο πίνακας θα πρέπει να υλοποιηθεί χρησιμοποιώντας δείκτες).


*/

#include <stdio.h>
#include <stdlib.h>

int find_minimum( void ) ;
int interchange_items( void );


int find_minimum( void )
{

}

int interchange_items( void )
{

}

int main( void *argv[], int argc )
{

}
